{"keras_version": "1.1.2", "config": [{"config": {"batch_input_shape": [null, 48, 96, 3], "name": "cropping2d_1", "trainable": true, "cropping": [[14, 0], [0, 0]], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"nb_row": 5, "bias": true, "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_1", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_2", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "border_mode": "same", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "input_dim": null, "name": "hidden1", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "input_dim": null, "name": "hidden3", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "input_dim": null, "name": "output", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}
