{"config": [{"class_name": "Cropping2D", "config": {"cropping": [[14, 0], [0, 0]], "batch_input_shape": [null, 48, 96, 3], "name": "cropping2d_1", "input_dtype": "float32", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 5, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "subsample": [2, 2], "activation": "linear", "activity_regularizer": null, "nb_col": 5, "bias": true, "W_constraint": null, "nb_filter": 24, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 3, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "nb_filter": 36, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "name": "hidden1", "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 100, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "name": "hidden3", "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 10, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "name": "output", "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null}}], "class_name": "Sequential", "keras_version": "1.1.2"}
