{"keras_version": "1.1.2", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "batch_input_shape": [null, 48, 96, 3], "input_dtype": "float32", "name": "cropping2d_1", "cropping": [[14, 0], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "activation": "linear", "b_constraint": null, "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "hidden1", "activation": "linear", "b_constraint": null, "bias": true, "input_dim": null, "output_dim": 100, "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "hidden3", "activation": "linear", "b_constraint": null, "bias": true, "input_dim": null, "output_dim": 10, "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "output", "activation": "linear", "b_constraint": null, "bias": true, "input_dim": null, "output_dim": 1, "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}], "class_name": "Sequential"}
